{
  "5": {
    "original_title": "feat(network): Compartilhamento Local via QR Code (Magic Share)",
    "original_desc_hash": "##ContextoAtualmente,apósbaixarumvídeoouimagemnoKingo(PC),ousuárionãotemumaformana_2066",
    "title_i18n": {
      "pt-BR": "Compartilhamento Local via QR Code (Magic Share)",
      "en-US": "Local Sharing via QR Code (Magic Share)",
      "es-ES": "Compartir Local vía Código QR (Magic Share)",
      "fr-FR": "Partage Local via QR Code (Magic Share)",
      "de-DE": "Lokales Teilen via QR-Code (Magic Share)"
    },
    "description_i18n": {
      "pt-BR": "## Contexto\nAtualmente, após baixar um vídeo ou imagem no Kingo (PC), o usuário não tem uma forma nativa e rápida de passar esse conteúdo para o celular. Depender de nuvem (Google Drive/WhatsApp) é lento e consome banda de internet desnecessariamente.\n## Motivação\nCriar uma experiência de \"fricção zero\" onde o usuário apenas aponta a câmera do celular para o Kingo e o download começa instantaneamente via rede local (P2P), aproveitando a velocidade máxima do Wi-Fi.\n## Problema\nTransferir arquivos grandes do PC para dispositivos móveis é um processo chato que geralmente envolve cabos USB ou uploads para serviços externos, o que mata a agilidade de um app de download.\n## Proposta Técnica\nImplementar um **Servidor de Transmissão Efêmero** no Go:\n1. **Backend (Go):** \n   - Utilizar `net/http` para subir um servidor web temporário em uma porta aleatória.\n   - Implementar um sistema de **IP Discovery** para identificar o endereço do PC na rede local (ex: 192.168.x.x).\n   - Servir o arquivo di",
      "en-US": "## Context\nCurrently, after downloading a video or image on Kingo (PC), the user doesn't have a native and quick way to transfer this content to their phone. Relying on the cloud (Google Drive/WhatsApp) is slow and unnecessarily consumes internet bandwidth.\n## Motivation\nCreate a \"zero friction\" experience where the user just points their phone's camera at Kingo and the download starts instantly via local network (P2P), taking advantage of the maximum Wi-Fi speed.\n## Problem\nTransferring large files from PC to mobile devices is a tedious process that usually involves USB cables or uploads to external services, which kills the agility of a download app.\n## Technical Proposal\nImplement an **Ephemeral Transmission Server** in Go:\n1. **Backend (Go):** \n   - Use `net/http` to start a temporary web server on a random port.\n   - Implement an **IP Discovery** system to identify the PC's address on the local network (e.g., 192.168.x.x).\n   - Serve the file di",
      "es-ES": "## Contexto\nActualmente, después de descargar un video o imagen en Kingo (PC), el usuario no tiene una forma nativa y rápida de pasar este contenido al celular. Depender de la nube (Google Drive/WhatsApp) es lento y consume banda ancha innecesariamente.\n## Motivación\nCrear una experiencia de \"fricción cero\" donde el usuario solo apunta la cámara del celular a Kingo y la descarga comienza instantáneamente vía red local (P2P), aprovechando la velocidad máxima del Wi-Fi.\n## Problema\nTransferir archivos grandes de PC a dispositivos móviles es un proceso tedioso que generalmente involucra cables USB o subidas a servicios externos, lo que mata la agilidad de una app de descarga.\n## Propuesta Técnica\nImplementar un **Servidor de Transmisión Efímero** en Go:\n1. **Backend (Go):** \n   - Utilizar `net/http` para subir un servidor web temporal en un puerto aleatorio.\n   - Implementar un sistema de **IP Discovery** para identificar la dirección del PC en la red local (ej: 192.168.x.x).\n   - Servir el archivo di",
      "fr-FR": "## Contexte\nActuellement, après avoir téléchargé une vidéo ou une image sur Kingo (PC), l'utilisateur n'a pas de moyen natif et rapide de transférer ce contenu sur son téléphone. Dépendre du cloud (Google Drive/WhatsApp) est lent et consomme inutilement de la bande passante internet.\n## Motivation\nCréer une expérience \"zéro friction\" où l'utilisateur pointe simplement l'appareil photo de son téléphone vers Kingo et le téléchargement commence instantanément via le réseau local (P2P), en tirant parti de la vitesse maximale du Wi-Fi.\n## Problème\nTransférer des fichiers volumineux d'un PC vers des appareils mobiles est un processus fastidieux qui implique généralement des câbles USB ou des téléchargements vers des services externes, ce qui nuit à l'agilité d'une application de téléchargement.\n## Proposition Technique\nImplémenter un **Serveur de Transmission Éphémère** en Go :\n1. **Backend (Go) :** \n   - Utiliser `net/http` pour lancer un serveur web temporaire sur un port aléatoire.\n   - Implémenter un système de **IP Discovery** pour identifier l'adresse du PC sur le réseau local (ex : 192.168.x.x).\n   - Servir le fichier di",
      "de-DE": "## Kontext\nDerzeit hat der Benutzer nach dem Herunterladen eines Videos oder Bildes auf Kingo (PC) keine native und schnelle Möglichkeit, diesen Inhalt auf sein Telefon zu übertragen. Die Nutzung der Cloud (Google Drive/WhatsApp) ist langsam und verbraucht unnötig Internetbandbreite.\n## Motivation\nErstellen Sie eine \"reibungslose\" Erfahrung, bei der der Benutzer einfach die Kamera seines Telefons auf Kingo richtet und der Download sofort über das lokale Netzwerk (P2P) beginnt, wodurch die maximale Wi-Fi-Geschwindigkeit genutzt wird.\n## Problem\nDas Übertragen großer Dateien vom PC auf mobile Geräte ist ein mühsamer Prozess, der normalerweise USB-Kabel oder Uploads zu externen Diensten beinhaltet, was die Agilität einer Download-App beeinträchtigt.\n## Technischer Vorschlag\nImplementieren Sie einen **Ephemeral Transmission Server** in Go:\n1. **Backend (Go):** \n   - Verwenden Sie `net/http`, um einen temporären Webserver auf einem zufälligen Port zu starten.\n   - Implementieren Sie ein **IP Discovery**-System, um die Adresse des PCs im lokalen Netzwerk zu identifizieren (z. B. 192.168.x.x).\n   - Dienen Sie der Datei di"
    }
  },
  "6": {
    "original_title": "feat(browser): Extensão Oficial e Refinamento de Deep Links (Warm Start)",
    "original_desc_hash": "##ContextoOecossistemaKingoprecisadeumaintegraçãomaisfluidacomonavegador.Atualmente,o_2388",
    "title_i18n": {
      "pt-BR": "Extensão e Refinamento de Deep Links (Warm Start)",
      "en-US": "Browser Extension and Deep Link Refinement (Warm Start)",
      "es-ES": "Extensión de navegador y refinamiento de enlaces profundos (Warm Start)",
      "fr-FR": "Extension de navigateur et affinement des liens profonds (Warm Start)",
      "de-DE": "Browsererweiterung und Deep-Link-Verfeinerung (Warm Start)"
    },
    "description_i18n": {
      "pt-BR": "## Contexto\nO ecossistema Kingo precisa de uma integração mais fluida com o navegador. Atualmente, o usuário depende do monitor de clipboard ou de copiar/colar manualmente. O esquema de protocolo `kingo://` já existe no código, mas o comportamento de \"instância única\" ainda não foi refinado.\n## Motivação\nPermitir que o usuário envie vídeos para o Kingo com apenas um clique diretamente do YouTube/Instagram, sem a necessidade de copiar links para a área de transferência. Isso torna o fluxo de trabalho muito mais rápido e profissional.\n## Problema\n1. **Falta de Bridge:** Não há uma extensão oficial que facilite o envio de URLs.\n2. **Redundância de Janelas:** Ao clicar em um link `kingo://` com o app já aberto, o Windows tenta abrir uma segunda instância do Kingo, resultando em duas janelas e erro de concorrência no banco de dados.\n## Proposta Técnica\n### 1. Extensão de Navegador (Kingo Bridge)\n* Criar uma extensão (Manifest v3) compatível com Chrome, Edge e Brave.\n* Adicionar um botão \"Ba",
      "en-US": "## Context\nThe Kingo ecosystem needs a more seamless integration with the browser. Currently, the user relies on the clipboard monitor or manual copy/paste. The `kingo://` protocol scheme already exists in the code, but the \"single instance\" behavior has not yet been refined.\n## Motivation\nAllow the user to send videos to Kingo with just one click directly from YouTube/Instagram, without the need to copy links to the clipboard. This makes the workflow much faster and more professional.\n## Problem\n1. **Lack of Bridge:** There is no official extension to facilitate sending URLs.\n2. **Window Redundancy:** When clicking a `kingo://` link with the app already open, Windows tries to open a second instance of Kingo, resulting in two windows and a database concurrency error.\n## Technical Proposal\n### 1. Browser Extension (Kingo Bridge)\n* Create an extension (Manifest v3) compatible with Chrome, Edge, and Brave.\n* Add a \"Ba",
      "es-ES": "## Contexto\nEl ecosistema Kingo necesita una integración más fluida con el navegador. Actualmente, el usuario depende del monitor del portapapeles o de copiar/pegar manualmente. El esquema de protocolo `kingo://` ya existe en el código, pero el comportamiento de \"instancia única\" aún no se ha refinado.\n## Motivación\nPermitir que el usuario envíe videos a Kingo con un solo clic directamente desde YouTube/Instagram, sin la necesidad de copiar enlaces al portapapeles. Esto hace que el flujo de trabajo sea mucho más rápido y profesional.\n## Problema\n1. **Falta de Bridge:** No hay una extensión oficial que facilite el envío de URL.\n2. **Redundancia de Ventanas:** Al hacer clic en un enlace `kingo://` con la aplicación ya abierta, Windows intenta abrir una segunda instancia de Kingo, lo que resulta en dos ventanas y un error de concurrencia en la base de datos.\n## Propuesta Técnica\n### 1. Extensión de Navegador (Kingo Bridge)\n* Crear una extensión (Manifest v3) compatible con Chrome, Edge y Brave.\n* Añadir un botón \"Ba",
      "fr-FR": "## Contexte\nL'écosystème Kingo a besoin d'une intégration plus fluide avec le navigateur. Actuellement, l'utilisateur dépend du moniteur du presse-papiers ou du copier/coller manuel. Le schéma de protocole `kingo://` existe déjà dans le code, mais le comportement \"instance unique\" n'a pas encore été affiné.\n## Motivation\nPermettre à l'utilisateur d'envoyer des vidéos à Kingo en un seul clic directement depuis YouTube/Instagram, sans avoir besoin de copier les liens dans le presse-papiers. Cela rend le flux de travail beaucoup plus rapide et plus professionnel.\n## Problème\n1. **Manque de Bridge :** Il n'y a pas d'extension officielle pour faciliter l'envoi d'URL.\n2. **Redondance des fenêtres :** En cliquant sur un lien `kingo://` avec l'application déjà ouverte, Windows essaie d'ouvrir une seconde instance de Kingo, ce qui entraîne deux fenêtres et une erreur de concurrence dans la base de données.\n## Proposition technique\n### 1. Extension de navigateur (Kingo Bridge)\n* Créer une extension (Manifest v3) compatible avec Chrome, Edge et Brave.\n* Ajouter un bouton \"Ba",
      "de-DE": "## Kontext\nDas Kingo-Ökosystem benötigt eine nahtlosere Integration mit dem Browser. Derzeit ist der Benutzer auf die Zwischenablage-Überwachung oder manuelles Kopieren/Einfügen angewiesen. Das Protokollschema `kingo://` existiert bereits im Code, aber das Verhalten \"Einzelinstanz\" wurde noch nicht verfeinert.\n## Motivation\nDem Benutzer ermöglichen, Videos mit nur einem Klick direkt von YouTube/Instagram an Kingo zu senden, ohne Links in die Zwischenablage kopieren zu müssen. Dies macht den Workflow viel schneller und professioneller.\n## Problem\n1. **Fehlender Bridge:** Es gibt keine offizielle Erweiterung, um das Senden von URLs zu erleichtern.\n2. **Fensterredundanz:** Wenn auf einen `kingo://`-Link geklickt wird, während die App bereits geöffnet ist, versucht Windows, eine zweite Instanz von Kingo zu öffnen, was zu zwei Fenstern und einem Datenbank-Concurrency-Fehler führt.\n## Technischer Vorschlag\n### 1. Browsererweiterung (Kingo Bridge)\n* Erstellen Sie eine Erweiterung (Manifest v3), die mit Chrome, Edge und Brave kompatibel ist.\n* Fügen Sie eine \"Ba"
    }
  },
  "7": {
    "original_title": "feat(core): Migração Arquitetural para Wails v3",
    "original_desc_hash": "##ContextoOKingoamadureceuesuaarquiteturaatualemWailsv2começaalimitaraexperiênciade_2503",
    "title_i18n": {
      "pt-BR": "Migração Arquitetural para Wails v3",
      "en-US": "Architectural Migration to Wails v3",
      "es-ES": "Migración Arquitectónica a Wails v3",
      "fr-FR": "Migration Architecturale vers Wails v3",
      "de-DE": "Architekturmigration zu Wails v3"
    },
    "description_i18n": {
      "pt-BR": "## Contexto\nO Kingo amadureceu e sua arquitetura atual em Wails v2 começa a limitar a experiência de \"App Nativo\". A migração para a v3 Alpha/Beta é o passo necessário para transformar o Kingo em um utilitário de sistema robusto e multiplataforma.\n## Motivação\nA v3 traz suporte primário a **Multi-window**, o que é crucial para nosso sistema de notificações e overlays. Além disso, a nova API do Wails v3 é muito mais próxima das capacidades nativas do SO (Windows/Mac/Linux), permitindo uma integração profunda com o sistema que a v2 não alcança sem \"hacks\".\n## Problema Atual (Limitações da v2)\n1. **Notificações Limitadas:** Atualmente nossos Toasts (como o de Clipboard) vivem \"dentro\" da janela principal. Se o app estiver minimizado, o usuário não vê nada.\n2. **Ciclo de Vida:** O controle de Single Instance e eventos de sistema (como suspensão/resumo) são menos elegantes na v2.\n3. **Tray e Menus:** A v3 oferece um controle muito superior sobre a bandeja do sistema (System Tray) e menus de",
      "en-US": "## Context\nKingo has matured and its current architecture in Wails v2 is starting to limit the \"Native App\" experience. Migrating to v3 Alpha/Beta is the necessary step to transform Kingo into a robust and cross-platform system utility.\n## Motivation\nv3 brings primary support for **Multi-window**, which is crucial for our notification and overlay system. In addition, the new Wails v3 API is much closer to the native capabilities of the OS (Windows/Mac/Linux), allowing for deep integration with the system that v2 does not achieve without \"hacks\".\n## Current Problem (v2 Limitations)\n1. **Limited Notifications:** Currently our Toasts (like the Clipboard one) live \"inside\" the main window. If the app is minimized, the user sees nothing.\n2. **Lifecycle:** The control of Single Instance and system events (such as suspend/resume) are less elegant in v2.\n3. **Tray and Menus:** v3 offers much superior control over the system tray and menus of",
      "es-ES": "## Contexto\nKingo ha madurado y su arquitectura actual en Wails v2 está empezando a limitar la experiencia de \"App Nativo\". La migración a la v3 Alpha/Beta es el paso necesario para transformar Kingo en una utilidad de sistema robusta y multiplataforma.\n## Motivación\nv3 trae soporte primario para **Multi-window**, lo cual es crucial para nuestro sistema de notificaciones y overlays. Además, la nueva API de Wails v3 está mucho más cerca de las capacidades nativas del SO (Windows/Mac/Linux), permitiendo una integración profunda con el sistema que v2 no logra sin \"hacks\".\n## Problema Actual (Limitaciones de v2)\n1. **Notificaciones Limitadas:** Actualmente nuestros Toasts (como el de Clipboard) viven \"dentro\" de la ventana principal. Si la app está minimizada, el usuario no ve nada.\n2. **Ciclo de Vida:** El control de Single Instance y eventos del sistema (como suspensión/reanudación) son menos elegantes en v2.\n3. **Tray y Menús:** v3 ofrece un control mucho superior sobre la bandeja del sistema (System Tray) y menús de",
      "fr-FR": "## Contexte\nKingo a mûri et son architecture actuelle dans Wails v2 commence à limiter l'expérience \"App Natif\". La migration vers la v3 Alpha/Beta est l'étape nécessaire pour transformer Kingo en un utilitaire système robuste et multiplateforme.\n## Motivation\nv3 apporte un support principal pour **Multi-window**, ce qui est crucial pour notre système de notifications et d'overlays. De plus, la nouvelle API de Wails v3 est beaucoup plus proche des capacités natives du système d'exploitation (Windows/Mac/Linux), permettant une intégration profonde avec le système que v2 n'atteint pas sans \"hacks\".\n## Problème actuel (Limitations de la v2)\n1. **Notifications Limitées:** Actuellement, nos Toasts (comme celui du presse-papiers) vivent \"à l'intérieur\" de la fenêtre principale. Si l'application est minimisée, l'utilisateur ne voit rien.\n2. **Cycle de vie:** Le contrôle de Single Instance et des événements système (comme la suspension/reprise) est moins élégant dans v2.\n3. **Tray et Menus:** v3 offre un contrôle bien supérieur sur le plateau système (System Tray) et les menus de",
      "de-DE": "## Kontext\nKingo ist gereift und seine aktuelle Architektur in Wails v2 beginnt, die \"Native App\"-Erfahrung einzuschränken. Die Migration zu v3 Alpha/Beta ist der notwendige Schritt, um Kingo in ein robustes und plattformübergreifendes Systemdienstprogramm zu verwandeln.\n## Motivation\nv3 bringt primäre Unterstützung für **Multi-window**, was für unser Benachrichtigungs- und Overlay-System entscheidend ist. Darüber hinaus ist die neue Wails v3 API viel näher an den nativen Fähigkeiten des Betriebssystems (Windows/Mac/Linux), was eine tiefgreifende Integration mit dem System ermöglicht, die v2 ohne \"Hacks\" nicht erreicht.\n## Aktuelles Problem (v2-Einschränkungen)\n1. **Eingeschränkte Benachrichtigungen:** Derzeit leben unsere Toasts (wie der für die Zwischenablage) \"innerhalb\" des Hauptfensters. Wenn die App minimiert ist, sieht der Benutzer nichts.\n2. **Lebenszyklus:** Die Steuerung von Single Instance und Systemereignissen (wie Anhalten/Fortsetzen) ist in v2 weniger elegant.\n3. **Tray und Menüs:** v3 bietet eine viel bessere Kontrolle über das System-Tray und Menüs von"
    }
  }
}